## 프로젝트 설명
- 인사정보 : 개인사원, 조직, 급여 등의 포괄적인 업무를 말함 (기본 인사정보를 관리하기 위해 필요한 테이블을 생성하고 자료 등록
- 개인 사원정보, 부양 가족정보, 부서정보, 직급정보로 분리해서 관리
    - 개인 사원정보 : 이름, 직급, 부서, 입사일 등 개개인의 정보를 관리하도록함
    - 부양가족 : 사원과의 관계, 이름 등 부양가족정보를 관리
    - 부서와 직급 : 사원에서 코드정보만 등록하기 때문에 해당 코드의 코드명을 관리
    - 급여내역 : 지급일자, 급여종류, 총 지급액, 총 공제액, 실제 지급액 정보만 관리

---

# 실습

## 생성하기

### 부서 테이블 생성하기
- 부서코드, 부서명, 지역 컬럼으로 구성

<pre>
CREATE TABLE dept (
	deptno INT PRIMARY KEY,
	dname VARCHAR(20) NOT NULL,
	loc VARCHAR(20) 
); 
</pre>

### 직급테이블 생성하기
- 직급코드, 직급명칭, 소트순서 컬럼으로 구성

<pre>
CREATE TABLE jikgb (
	jikgb_code char(2) PRIMARY KEY,
	jikgb_name VARCHAR(20) NOT NULL,
	jikgb_sort char(2) 
);
</pre>

### 사원테이블 생성하기
- 사원번호, 이름, 부서코드, 직급코드, 입사일, 생년월일 컬럼으로 구성

<pre>
CREATE TABLE emp ( 
	empno INT PRIMARY KEY,
	ename VARCHAR(20) NOT NULL,
	deptno INT REFERENCES dept(deptno),
	jikgb_code CHAR(2) REFERENCES jikgb(jikgb_code),
	hiredate DATE,
	birth_date CHAR(8)
);
</pre>

### 부양가족 테이블 생성하기
- 사번, 관계코드, 가족이름으로 구성

<pre>
CREATE TABLE family ( 
	empno INT,
	f_code INT,
	f_name VARCHAR(20) NOT NULL,
 	PRIMARY KEY( empno, f_code) 
);
</pre>

### 급여지급 테이블 생성하기
- 급여년월, 사원번호, 급여구분, 지급총액, 공제총액, 차감지급액으로 구성

<pre>
CREATE TABLE salary (
	yymm CHAR(6),
	empno INT,
	gubun CHAR(1) ,
	total_amt INT,
	deduct_amt INT,
	pay_amt INT,
 	PRIMARY KEY ( yymm, empno, gubun) 
);
</pre>

---

## 입력하기

### 부서테이블 자료 입력하기

<pre>
INSERT INTO dept VALUES (10,'인사팀','서울');
INSERT INTO dept VALUES (20,'개발팀','대전');
INSERT INTO dept VALUES (30,'지원팀','인천');
INSERT INTO dept VALUES (40,'홍보팀','서울');
INSERT INTO dept(deptno,dname) VALUES ( 50,'기술팀'); 
</pre>

### 직급테이블 자료 입력하기

<pre>
INSERT INTO jikgb VALUES ('S1','사장','A1');
INSERT INTO jikgb VALUES ('S2','이사','A2');
INSERT INTO jikgb VALUES ('M1','부장','B1');
INSERT INTO jikgb VALUES ('M2','차장','B2');
INSERT INTO jikgb VALUES ('M3','과장','B3');
INSERT INTO jikgb VALUES ('G1','대리','C1');
INSERT INTO jikgb VALUES ('G2','사원','C2');
</pre>

### 사원테이블 자료 입력하기

<pre>
INSERT INTO emp VALUES (100,'홍길동',20,'G1','1998-12-01','19750123');
INSERT INTO emp VALUES (101,'박길동',10,'G2','1999-01-15','19821011');
INSERT INTO emp VALUES (102,'최길동',10,'G1','1999-01-15','19781212');
INSERT INTO emp VALUES (103,'김훈'  ,30,'M1','2000-01-03','19650417');
INSERT INTO emp VALUES (104,'박준'  ,20,'M2','2001-04-04','19760321');
INSERT INTO emp VALUES (105,'이공명',10,'M3','2001-07-25','19720505');
INSERT INTO emp VALUES (106,'문국장',10,'S1','2001-08-15','19600101');
INSERT INTO emp VALUES (107,'김현기',40,'S2','2005-07-07','19620809');
INSERT INTO emp VALUES (108,'이종법',20,'G2','2007-05-06','19801110');
INSERT INTO emp VALUES (109,'이지수',10,'G2','2010-10-10','19851231');
INSERT INTO emp VALUES (110,'박현숙',40,'M3','2010-12-01','19811205');
INSERT INTO emp VALUES (111,'최숙명',10,'G1','2011-01-05','19820303');
INSERT INTO emp VALUES (112,'이상용',20,'M2','2012-12-01','19760808');
INSERT INTO emp VALUES (113,'류성용',30,'M1','2013-01-01','19750529');
</pre>

### 부양가족 테이블 자료 입력하기

<pre>
INSERT INTO family VALUES (100,1,'홍길수');
INSERT INTO family VALUES (100,2,'김영자');
INSERT INTO family VALUES (103,1,'최영');
INSERT INTO family VALUES (107,1,'김부자');
INSERT INTO family VALUES (110,1,'박공') ;
INSERT INTO family VALUES (110,2,'김연수');
INSERT INTO family VALUES (113,1,'류지훈');
</pre>

### 급여 지급 테이블 자료 입력하기
<pre>
INSERT INTO salary VALUES ('201812',100,'1',2500000,88000,2412000);
INSERT INTO salary VALUES ('201812',101,'1',2700000,93000,2607000);
INSERT INTO salary VALUES ('201812',102,'1',3200000,120000,3080000);
INSERT INTO salary VALUES ('201812',103,'1',4300000,450000,3850000);
INSERT INTO salary VALUES ('201812',104,'1',5300000,770000,4530000);
INSERT INTO salary VALUES ('201812',105,'1',6600000,990000,5610000);
INSERT INTO salary VALUES ('201812',106,'1',7700000,1230000,6470000);
INSERT INTO salary VALUES ('201812',107,'1',7210000,1102890,6107110);
</pre>

---

## 조회하기

### 정렬해서 조회하기
- 사원테이블 자료에서 사원이름, 입사일, 생년월일을 조회합니다
- 결과는 생일이 빠른 순으로 정렬해서 나오도록 합니다.

<pre>
SELECT ename,hiredate,birth_date
FROM emp
ORDER BY birth_date;
</pre>

### 그룹함수 이용해서 조회하기
- 급여지급 테이블 이용해서 2018년 12월 급여중 지급액 총합계와 지급액 평균, 지급액 중 최대값, 지급액 중 최소값 조회

<pre>
SELECT sum(pay_amt), avg(pay_amt), max(pay_amt), min(pay_amt) 
FROM salary
WHERE yymm = '201812' AND gubun = '1';
</pre>

### 조인 이용해서 조회하기
- 사원테이블, 부서테이블 이용해서 서울지역에서 근무하는 사원들의 사원번호, 이름, 직급코드, 부서명 조회

<pre>
SELECT e.empno, e.ename, e.jikgb_code, d.dname
FROM emp e JOIN dept d
ON e.deptno = d.deptno
WHERE d.loc = '서울';
</pre>
<br>

- 사원테이블, 직급테이블 이용해서 사원 중 직급이름이 대리, 차장인 사원들만 이름, 입사일, 직급이름을 조회
<pre>
SELECT e.ename, e.hiredate, j.jikgb_name
FROM emp e JOIN jikgb j
ON e.jikgb_code = j.jikgb_code
WHERE j.jikgb_name IN ('대리','차장');
</pre>
<br>

- 사원테이블, 직급테이블, 부서테이블 이용해서 사원번호, 사원이름, 부서명, 직급이름을 직급이 높은 사원부터 나오도록 정렬해서 조회
<pre>
SELECT e.empno, e.ename, d.dname, j.jikgb_name
FROM emp e JOIN dept d 
ON e.deptno = d.deptno
JOIN jikgb j 
ON e.jikgb_code = j.jikgb_code
ORDER BY j.jikgb_sort;
</pre>

### 서브쿼리를 이용해서 조회하기
- 사원테이블, 급여지급 테이블 이용해서 2018년 12월 상여를 받은 사원들의 이름, 직급코드, 부서번호를 조회 (상여는 salary 테이블 gugbun이 2)

<pre>
SELECT ename, jikgb_code, deptno
FROM emp
WHERE empno IN ( SELECT empno 
                 FROM salary
                 WHERE yymm = '201812' AND gubun = '2');
</pre>